app/views/students/index.html.erb

SELECT COUNT(*) FROM "events" WHERE "events"."student_id" = 1 AND (rule_type != 16 and rule_type != 2 and rule_type != 3
---
        <td><%= student.class_info %></td>
        <td><%= link_to "违纪现象(#{student.events.count})", student %></td>