app/views/students/show.html.erb

SELECT COUNT(*) FROM "events" WHERE "events"."student_id" = 1 AND "events"."rule_type" = 15 AND ("events"."created_at" BETWEEN '2013-01-19 16:00:00.000000' AND '2013-01-20 16:00:00.000000')
---
          <li>
            上学迟到：<span><%= @student.events.where(:rule_type=>1,:created_at => t[1]).count %></span>次