app/views/home/_profile.html.erb

    <li style="font-size:14px;">
      迟到：本月<span style="color:blue;"><%= @student.events.where(:rule_type=>1,:created_at => @times[0][1]).count %></span>次,
      本学期<span style="color:blue;"><%= @student.events.where(:rule_type=>1,:created_at => @times[1][1]).count %></span>次.
    </li>
---
SELECT COUNT(*) FROM "events" WHERE "events"."student_id" = 1 AND "events"."rule_type" = 1 AND ("events"."created_at" BETWEEN '2013-01-01' AND '2013-01-31')