app/views/home/_room.html.erb

  <ul class="room">
    <%room.beds.each do |b|%>
---
SELECT "beds".* FROM "beds" WHERE "beds"."room_id" = 1