app/controllers/beds_controller.rb

SELECT "beds".* FROM "beds" LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "beds"
---
  def index
    @beds = Bed.paginate(:page => params[:page], :per_page =>10)

SELECT "beds".* FROM "beds" WHERE "beds"."id" = ? LIMIT 1  [["id", "current_floor"]]
---
  def show
    @bed = Bed.find(params[:id])

SELECT "beds".* FROM "beds" WHERE "beds"."id" = ? LIMIT 1  [["id", "12"]]
---
  def edit
    @bed = Bed.find(params[:id])

INSERT INTO "beds" ("created_at", "num", "room_id", "status", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 20 Jan 2013 21:44:29 CST +08:00], ["num", "1"], ["room_id", 1], ["status", nil], ["updated_at", Sun, 20 Jan 2013 21:44:29 CST +08:00]]
---
  def create
    @bed = Bed.new(params[:bed])

    respond_to do |format|
      if @bed.save

SELECT "beds".* FROM "beds" WHERE "beds"."id" = ? LIMIT 1  [["id", "12"]]
UPDATE "beds" SET "room_id" = 2, "updated_at" = '2013-01-20 15:01:57.081893' WHERE "beds"."id" = 12
---
  def update
    @bed = Bed.find(params[:id])

    respond_to do |format|
      if @bed.update_attributes(params[:bed])