app/controllers/events_controller.rb

SELECT "students".* FROM "students" WHERE "students"."id" IN (1)
SELECT COUNT(*) FROM "events" WHERE ("events"."created_at" BETWEEN '2013-01-19 16:00:00.000000' AND '2013-01-20 16:00:00.000000')
---
    else Event
    end

    @page_count = @events.includes(:student).where(
      :students=>stu_queries,
      :events=>event_queries
    ).count

SELECT "events".* FROM "events" WHERE ("events"."created_at" BETWEEN '2013-02-13 16:00:00.000000' AND '2013-02-14 16:00:00.000000') LIMIT 8 OFFSET 0
---

    if @page_count > 0

      @events = @events.includes(:student).where(
        :students=>stu_queries,
        :events=>event_queries
      ).paginate(
        :page => cur_page,
        :per_page =>per_page
      )

DELETE FROM "events" WHERE "events"."id" IN (3)
---
  def bulk_delete
    if params[:events]
      chosen = []
      params[:events][:chosen].each do |e|
        if e[1] == "1"
          chosen << e[0]
        end
      end

      Event.delete(chosen)

INSERT INTO "events" ("created_at", "remark", "rule_type", "student_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Fri, 15 Feb 2013 10:15:52 CST +08:00], ["remark", nil], ["rule_type", 0], ["student_id", 20130120], ["updated_at", Fri, 15 Feb 2013 10:15:52 CST +08:00]]
---
  def import
    counter = 0
    unless params[:post].blank?
      uploaded_io = params[:post][:attached]

      csv_text = File.open(uploaded_io.tempfile,"r:ISO-8859-1")
      csv = CSV.parse(csv_text, :headers => true)
      csv.each do |row|
        event = Event.new
        event.update_attributes(
          :student_id=>row[5].strip,
          :rule_type=>row[6].strip,
          :created_at=>row[4])
        counter +=1 if event.save