app/controllers/home_controller.rb

SELECT "students".* FROM "students" WHERE (name = '2013010' or num = '2013010') LIMIT 1
---
  def search

    if Time.now.month > 1 && Time.now.month < 8
      term_start = "#{Time.now.year}-02-01"
      term_end = "#{Time.now.year}-07-31"
    elsif Time.now.month < 2
      term_start = "#{Time.now.year - 1.year}-09-01"
      term_end = Time.now.strftime("%Y-%m%d")
    else
      term_start = "#{Time.now.year}-09-01"
      term_end = Time.now.strftime("%Y-%m%d")
    end

    @times = [
      ["本月",("#{Time.now.year}-#{Time.now.strftime("%m")}-01")..("#{Time.now.year}-#{Time.now.strftime("%m")}-31")],
      ["本学期",term_start..term_end]
    ]
    @student = Student.find(:first,:conditions => ["name = ? or num = ?",params[:keyword],params[:keyword]])

SELECT "students".* FROM "students" WHERE (name = '20123012' or num = '20123012') LIMIT 1
---
  def dormitory_search
    @student = Student.find(:first,:conditions => ["name = ? or num = ?",params[:keyword],params[:keyword]])

SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "events" ("created_at", "remark", "rule_type", "student_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 14 Feb 2013 17:01:35 CST +08:00], ["remark", ""], ["rule_type", 17], ["student_id", nil], ["updated_at", Thu, 14 Feb 2013 17:01:35 CST +08:00]]
UPDATE "beds" SET "status" = 2, "updated_at" = '2013-01-22 07:39:56.118471' WHERE "beds"."id" = 4
UPDATE "events" SET "student_id" = 1, "updated_at" = '2013-02-14 09:01:35.781840' WHERE "events"."id" = 1
---
  def change_dormitory_status
    @student = Student.find(params[:id])

    if params[:status]
      @student.bed.status = params[:status]
    end

    if params[:events]
      for item_hash in params[:events]
        #chech_box没有选中的时候，提交的值为"0"
        if item_hash[:rule_type] && item_hash[:rule_type] !="0"
          @student.events << Event.create(:rule_type=>item_hash[:rule_type],
            :remark=>item_hash[:remark])
        end
      end
    end


    respond_to do |format|
      if @student.bed.save