app/controllers/ratings_controller.rb

INSERT INTO "ratings" ("created_at", "lower_limit", "name", "updated_at", "upper_limit") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 20 Jan 2013 16:02:19 CST +08:00], ["lower_limit", 10], ["name", "三好学生"], ["updated_at", Sun, 20 Jan 2013 16:02:19 CST +08:00], ["upper_limit", 0]]
---
  def create
    @rating = Rating.new(params[:rating])

    respond_to do |format|
      if @rating.save

SELECT "ratings".* FROM "ratings" WHERE "ratings"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "ratings" WHERE "ratings"."id" = ?  [["id", 2]]
---
  def destroy
    @rating = Rating.find(params[:id])
    @rating.destroy