app/controllers/rooms_controller.rb

  def edit
    @room = Room.find(params[:id])
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @room = Room.new(params[:room])

    respond_to do |format|
      if @room.save
---
INSERT INTO "rooms" ("created_at", "floor", "num", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sun, 20 Jan 2013 16:28:29 CST +08:00], ["floor", 1], ["num", "101"], ["updated_at", Sun, 20 Jan 2013 16:28:29 CST +08:00]]