app/controllers/students_controller.rb

  def index
    if params[:student]
      query_hash = {}
      query_hash.merge!(:num => params[:student][:num]) if !params[:student][:num].blank?
      query_hash.merge!(:name => params[:student][:name]) if !params[:student][:name].blank?
      query_hash.merge!(:class_num => params[:student][:class]) if !params[:student][:class].blank?
      query_hash.merge!(:grade => params[:student][:grade]) if !params[:student][:grade].blank?
    else
      query_hash = "grade > 0"
    end

    @students = Student.where(query_hash)

    if params[:barcode]
      render :template=>"/students/barcode",:layout=>false
    else
      respond_to do |format|
        format.html {@students = @students.paginate(:page => params[:page], :per_page =>20)}
---
SELECT "students".* FROM "students" WHERE (grade > 0) LIMIT 4 OFFSET 0
SELECT COUNT(*) FROM "students" WHERE (grade > 0)

                s.class_info]

              Event::RULE_LIST.each do |r|
                data_row << s.events.where(:rule_type=>r[1]).count
---
SELECT COUNT(*) FROM "events" WHERE "events"."student_id" = 1 AND (rule_type != 16 and rule_type != 2 and rule_type != 3

  def create
    @student = Student.new(params[:student])

    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("avatar_content_type", "avatar_file_name", "avatar_file_size", "avatar_updated_at", "bed_id", "class_num", "created_at", "enter_tag", "grade", "name", "num", "sex", "state", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    result = nil
    #释放原来的床位
    Student.transaction do
      @student = Student.find(params[:id])
      if @student.bed_id && @student.bed_id !=params[:student][:bed_id]
        original_bed_status = @student.bed.status
        @student.bed.update_attributes(:status => 4)
        Bed.find(params[:student][:bed_id]).update_attributes(:status=>original_bed_status)
---
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "beds" SET "status" = 1, "updated_at" = '2013-01-21 04:54:47.320975' WHERE "beds"."id" = 1
UPDATE "students" SET "mobile" = '13602953927', "parent_mobile" = '13602999937', "updated_at" = '2013-01-22 01:45:48.207160' WHERE "students"."id" = 1
SELECT "beds".* FROM "beds" WHERE "beds"."id" = 1 LIMIT 1